cf/Tasks/бпсЗадача.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9.1">
	<Task>
		<Properties>
			<Name>бпсЗадача</Name>
			<Addressing>InformationRegister.бпсРегистрАдресации</Addressing>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФактическийИсполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФактическаяДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтложенаДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючЗадачи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<AddressingAttribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
			<AddressingAttribute>
				<Properties>
					<Name>РольАдресации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бпсРолиАдресации</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
			<AddressingAttribute>
				<Properties>
					<Name>ПодразделениеАдресации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бпсПодразделенияАдресации</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

cf/InformationRegisters/бпсОшибки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9.1">
	<InformationRegister>
		<Properties>
			<Name>бпсОшибки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОшибки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипОшибки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бпсТипыОшибок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/InformationRegisters/бпсСообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9.1">
	<InformationRegister>
		<Properties>
			<Name>бпсСообщения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Кому</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Тело</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПопыток</Name>
					<Comment>Если больше 5 попыток, тогда пропускаем сообщение</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОтправкиТелеграмм</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПопытокТелеграмм</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИДПользователяТелеграмм</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ИнформацияООшибке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектБД</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/InformationRegisters/бпсЗадачиПоБизнесПроцессам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9.1">
	<InformationRegister>
		<Properties>
			<Name>бпсЗадачиПоБизнесПроцессам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Рецензия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Согласовано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыводитьВОтчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Очередь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>БизнесПроцесс</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRef.бпсСогласование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаБизнесПроцесса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметСогласования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бпсПредметыСогласований</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОбъектБД</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсходныйБизнесПроцесс</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRef.бпсСогласование</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:TaskRef.бпсЗадача</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/Enums/бпсТипыОшибок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9.1">
	<Enum>
		<Properties>
			<Name>бпсТипыОшибок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеЗаполненыНастройкиПользователя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеЗаполненРегистрАдресации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеУдалосьОтправитьУведомление</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Tasks/бпсЗадача/Ext/ObjectModule.bsl
Процедура ПриЗаписи(Отказ)
	Если ЗначениеЗаполнено(БизнесПроцесс) Тогда
		СформироватьЗаписиРС_бпсЗадачиПоБизнесПроцессам(Отказ);	
	КонецЕсли;

	ОтправитьУведомлениеОЗадаче(Отказ);
КонецПроцедуры

Процедура ОтправитьУведомлениеОЗадаче(Отказ) Экспорт
	Если Отказ Тогда
		Возврат;
	Конецесли;
	
	Если НЕ ДополнительныеСвойства.Свойство("бпсЭтоНовый") ИЛИ ДополнительныеСвойства.бпсЭтоНовый = Ложь Тогда
		Возврат;
	Конецесли;
		
	ДопПараметры = Новый Структура();
	ДопПараметры.Вставить("Пользователь", Пользователь);
	ДопПараметры.Вставить("РольАдресации", РольАдресации);
	ДопПараметры.Вставить("ПодразделениеАдресации", ПодразделениеАдресации);
	ТЗИсполнителейЗадачи = Задачи.бпсЗадача.ПолучитьТЗИсполнителейЗадачи(ДопПараметры);
	
	Если ТЗИсполнителейЗадачи.Количество() = 0 Тогда
		ТекстОшибки = StrTemplate(NStr("ru = 'ВНИМАНИЕ! Не удалось определить исполнителей задачи для
                                        |РольАдресации [%1]
                                        |ПодразделениеАдресации [%2]'"), РольАдресации, ПодразделениеАдресации);
		РегистрыСведений.бпсОшибки.ДобавитьОшибку(ТекстОшибки,ПредопределенноеЗначение("Перечисление.бпсТипыОшибок.НеЗаполненРегистрАдресации"));
	Конецесли;
	
	ТЗИсполнителейЗадачи.Свернуть("Пользователь");
	Для каждого СтрокаТЗИсполнителейЗадачи из ТЗИсполнителейЗадачи цикл
		ПользовательДляОтправки = СтрокаТЗИсполнителейЗадачи.Пользователь;		
		
		ТемаУведомления = NStr("ru = 'В системе 1С Вам поступила задача'");
		ТекстУведомления = NStr("ru = 'Вам поступила задача: '") + Наименование + Символы.ПС;
		
		ПараметрыПисьма = Новый Структура;
		ПараметрыПисьма.Вставить("ПользовательДляОтправки", ПользовательДляОтправки);
		ПараметрыПисьма.Вставить("Тело", ТекстУведомления);
		ПараметрыПисьма.Вставить("Тема", ТемаУведомления);
		ПараметрыПисьма.Вставить("ОбъектБД", БизнесПроцесс.ОбъектБД);
		ПараметрыПисьма.Вставить("ОтправлятьУведомлениеТелеграмм", Истина);
		
		ИдентификаторСообщения = РегистрыСведений.бпсСообщения.ДобавитьСообщение(ПараметрыПисьма);
	Конеццикла;

КонецПроцедуры //ОтправитьУведомлениеОЗадаче(Отказ)

Процедура СформироватьЗаписиРС_бпсЗадачиПоБизнесПроцессам(Отказ) Экспорт	
	Если Отказ Тогда
		Возврат;
	Конецесли;
	
	бпсЭтоНовый = Неопределено;
	Если ДополнительныеСвойства.Свойство("бпсЭтоНовый") Тогда
		бпсЭтоНовый = ДополнительныеСвойства.бпсЭтоНовый;	
	Конецесли;
	
	Если НЕ бпсЭтоНовый ИЛИ НЕ ЗначениеЗаполнено(бпсЭтоНовый) Тогда
		Возврат;
	Конецесли;
	
	ДопПараметры = Новый Структура();
	ДопПараметры.Вставить("ЗадачаСсылка",Ссылка);
	
	НаборЗаписей = РегистрыСведений.бпсЗадачиПоБизнесПроцессам.СоздатьНаборЗаписей();
	НаборЗаписей.СформироватьЗаписи(ДопПараметры,Отказ);
КонецПроцедуры 

Процедура ПередЗаписью(Отказ)
	ДополнительныеСвойства.Вставить("бпсЭтоНовый", ЭтоНовый());
	
	Если Выполнена Тогда
		//ФактическийИсполнитель = ПараметрыСеанса.ТекущийПользователь;		
		ФактическийИсполнитель = ПараметрыСеанса.CurrentUser;		
		ФактическаяДатаВыполнения = ТекущаяДата();
		ОтложенаДо = Дата(1, 1, 1);
	Конецесли;
КонецПроцедуры
